# 1. Напишите программу, удаляющую из текста все слова, содержащие ""абв""
list_task = 'Напишите программу, удалабвяющую из текстаабв все слоабвва, содержаабвщие ""абв""'
list_task_sp = [list_task.split(' ')]
print(list_task_sp)