# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# print('???')
# day = int(input())
# if day == 6 or day == 7:
#     print('выходной')
# else:
#     print('не выходной')


# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).


# print('введите X не равный 0')
# x = int(input())
# print('введите Y не равный 0')
# y = int(input())
# if x == 0 or y == 0: print("введёные координаты не соответствуют условиям")
# if x > 0 and y > 0: print("первая четверть")
# if x < 0 and y > 0: print("вторая  четверть")
# if x < 0 and y < 0: print("третья четверть")
# if x > 0 and y < 0: print("четвёртая четверть")

